app/views/songs/index.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  <li><%= display_artist(song) %> - <%= link_to song.title, song_path(song) %></li>
  <%= link_to "Add New Song", edit_song_path(song) if song.artist.blank? %>